package module4.programmingwithclass.simplestclass.t8;

import java.util.Arrays;

/*
8. Создать класс Customer, спецификация которого приведена ниже. Определить конструкторы, set- и get- методы
и метод toString(). Создать второй класс, агрегирующий массив типа Customer, с подходящими конструкторами
и методами. Задать критерии выбора данных и вывести эти данные на консоль.
Класс Customer: id, фамилия, имя, отчество, адрес, номер кредитной карточки, номер банковского счета.
Найти и вывести:
a) список покупателей в алфавитном порядке;
b) список покупателей, у которых номер кредитной карточки находится в заданном интервале
 */
public class CustomerBase {
    private static CustomerBase base = null;
    private final Customer[] customers;

    private CustomerBase() {
        this.customers = getData();
    }

    public static CustomerBase getBase() {
        if (base == null) {
            base = new CustomerBase();
        }
        return base;
    }

    private static Customer[] getData() {
        return new Customer[]{
                new Customer(1, "Лобанова", "Надежда", "Мироновна", "г. Минск, пр. Гагарина, 82", 5404367070925254L, "4731276391687559"),
                new Customer(2, "Лобанова", "Варвара", "Данииловна", "г. Минск, ул. Гоголя, 3", 5404365616872485L, "4068960004090847"),
                new Customer(3, "Рогова", "Дарья", "Артёмовна", "г. Минск, пер. Чехова, 38", 5404361407833042L, "4134447514438153"),
                new Customer(4, "Антонов", "Максим", "Иванович", "г. Минск, пл. Косиора, 18", 5404362740746966L, "4237925005075747"),
                new Customer(5, "Фролов", "Олег", "Макарович", "г. Минск, ул. Космонавтов, 79", 5404361333552435L, "4672927488555049"),
                new Customer(6, "Литвинов", "Андрей", "Антонович", "г. Минск, ул. Домодедовская, 60", 5404366680283047L, "4291110337762949"),
                new Customer(7, "Соловьева", "Алина", "Егоровна", "г. Минск, ул. Ломоносова, 14", 5404369004148391L, "4782542595469955"),
                new Customer(8, "Зотова", "Валерия", "Максимовна", "г. Минск, ул. Жебрунова, 6", 5404362674963652L, "4517372412435209"),
                new Customer(9, "Виноградов", "Максим", "Ильич", "г. Минск, ул. Новорублевская, 2", 5404366150218473L, "4859005882415626"),
                new Customer(10, "Соловьев", "Михаил", "Иванович", "г. Минск, ул. Мурзинская, 22", 5404360919008564L, "4645723654544147")
        };
    }

    public Customer[] getCustomers() {
        return customers;
    }
}
